# GetHostId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetHostId Method
RebarUpdateCurvesData Class See Also
---
Gets the id of the host structural for this rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ElementId GetHostId()
```

Visual Basic
---
```text
Public Function GetHostId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetHostId()
```

# ### Return Value
Returns the id of the host structural for this rebar.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace